k
jagannatha
shetty
j
grant
special
leave
proceed
dispose
appeal
shobha
rani
appellant
husband
madhukar
reddi
respondent
u
wife
postgraduate
biological
science
medical
doctor
happily
married
december
happiness
last
long
started
exchanging
letter
bitter
feeling
began
accuse
one
stage
thought
winding
mutual
consent
perhaps
disgust
would
better
happened
unfortunately
materialise
ultimately
landed
court
moved
divorce
ground
cruelty
referring
fact
let
consider
law
simpliciter
section
hindu
marriage
act
provides
far
material
solemnized
whether
commencement
may
petition
presented
either
dissolved
decree
party
solemnization
treated
petitioner
us
word
defined
indeed
could
used
relation
human
conduct
behaviour
respect
matrimonial
duty
obligation
course
adversely
affecting
mental
physical
intentional
unintentional
problem
determine
question
degree
present
difficulty
first
enquiry
must
begin
nature
cruel
treatment
second
impact
mind
spouse
caused
reasonable
apprehension
harmful
injurious
live
matter
inference
drawn
taking
account
effect
complaining
however
case
complained
bad
enough
per
se
unlawful
illegal
need
enquired
considered
established
proved
admitted
necessary
bear
marked
change
life
around
responsibility
particular
find
sea
varying
house
person
therefore
make
complaint
partner
search
standard
set
stigmatised
another
alleged
largely
depend
upon
type
accustomed
economic
social
condition
also
culture
value
attach
importance
judge
lawyer
import
notion
go
parallel
generation
gap
keep
aside
custom
manner
le
precedent
lord
denning
said
sheldon
v
er
category
closed
different
deal
being
generally
similar
among
limit
kind
constitute
new
crop
depending
capacity
incapability
tolerate
wonderful
sic
realm
preliminary
observation
intended
emphasize
concerned
ideal
family
understand
made
grievance
reid
observed
gollins
affair
dealing
objective
offence
fall
man
woman
chandrachud
dr
n
g
dastane
mr
scc
p
para
assuming
exist
couple
near
probably
occasion
even
able
drown
difference
attitude
help
overlook
gloss
fault
failure
principle
unfold
story
came
seeking
dissolution
several
ignore
dowry
demand
parent
deep
rooted
evil
society
customary
love
affection
olden
day
give
bride
bridegroom
time
good
intention
provide
something
back
system
girl
much
educated
unwilling
take
gainful
employment
opportunity
supplement
income
become
financially
independent
yet
reason
gift
daughter
entitled
share
joint
property
brother
hence
father
consideration
cash
right
small
portion
recognised
year
practice
developed
boy
member
demanding
often
extended
instance
harassment
complied
order
curb
parliament
enacted
prohibition
prohibited
giving
spite
enactment
pernicious
continued
community
committee
appointed
examine
working
remarked
sought
done
away
hand
increased
leap
bound
assumed
grotesque
alarming
proportion
intervened
amendment
considerable
likewise
indian
penal
code
amended
introducing
entirely
hitherto
unknown
criminal
jurisprudence
introduced
following
term
relative
subjecting
whoever
subject
shall
punished
imprisonment
extend
three
liable
fine
explanation
purpose
mean
wilful
likely
drive
commit
suicide
cause
grave
injury
danger
limb
health
b
view
coercing
related
meet
valuable
security
dimension
given
concept
amount
constitutes
requires
preponderance
probability
civil
beyond
doubt
accepted
test
proof
scr
neither
enumerates
judicial
separation
governs
jurisdiction
pas
proceeding
prove
confers
power
satisfied
mentioned
clause
e
considering
essentially
alter
turn
evidence
consists
pw
rw
produced
exchanged
appears
ex
dated
wrote
regarding
point
still
feel
nothing
wrong
asking
thousand
rupee
quite
common
thing
blamed
stated
mother
always
money
tell
happening
silent
sometimes
ask
reply
fixed
deposit
receipt
name
bank
half
two
lakh
besides
plot
jubilee
hill
afraid
telling
physically
mentally
told
entertained
went
regularly
every
felt
pestering
like
aversion
going
joined
school
teacher
trial
high
state
rejected
satisfactory
border
though
justify
viewed
perspective
young
upcoming
strange
regard
admission
demanded
read
whole
cross
examination
trying
confess
clear
prone
exaggerate
evident
food
habit
drinking
sensitivity
exaggeration
mountain
molehill
best
known
examined
support
contention
harassing
line
hypersensitive
imago
unnatural
circumstance
proper
angle
asks
rich
spare
unusual
requested
personal
expense
misunderstood
evidently
proceeded
basis
wanted
thrown
equally
sorrow
can
not
pleasure
cost
front
august
addressed
curious
unless
repeated
brushed
directly
discredit
judging
style
apply
try
nugget
truth
entire
content
isolation
background
accusation
written
advocate
counterpart
relevant
worst
form
ill
meted
client
constant
monies
brought
notice
prior
sum
r
scooter
thereafter
main
death
frequently
seen
newspaper
pointed
philosophy
since
sound
sole
object
get
standing
transferred
stand
somewhere
place
mention
pointer
alone
device
cumulative
lead
conclusion
part
show
misconstrued
scope
requirement
deliberate
think
earlier
variety
inexcusable
result
cultural
conflict
aggrieved
relief
context
seems
element
understood
ordinary
sense
harm
harass
hurt
inferred
brutal
easily
absence
otherwise
regarded
denied
reasoning
adopted
evershed
unable
accept
premise
involves
necessity
malignity
highly
charge
opinion
guilty
according
language
involve
presence
equivalent
follows
venture
injure
charged
aimed
essential
requisite
rather
bearing
approach
entitling
allow
reversal
judgment
dipak
misra
c
invoking
inherent
procedure
prayed
quashment
passed
learned
additional
session
fast
track
iv
sheikhpura
whereby
declined
entertain
accused
assailing
bereft
unnecessary
detail
required
exposited
adjudication
application
sent
alongwith
others
punishable
juge
filed
discharge
record
occurrence
taken
deoghar
jharkhand
inasmuch
deceased
staying
dairy
farm
territorial
foundation
prima
facie
implicate
crime
pertaining
expressed
perusal
allegation
vivid
initiation
culminated
accordingly
heard
ashwini
kumar
sinha
counsel
mayanand
jha
addi
tional
public
prosecutor
submitted
fallen
error
expressing
took
real
action
arisen
bolsfer
submission
commended
decision
rendered
bhura
ram
rajasthan
pljr
sc
contra
urged
within
despjte
factum
occurred
contended
continuing
date
nexus
correctly
held
rivalised
raised
bar
seemly
refer
chapter
xiii
brevity
inquiry
ordinarily
inquired
whose
local
ted
relates
provision
uncertain
area
committed
partly
continu
ing
continues
tried
aforesaid
interpreted
abraham
ajith
inspector
police
chennai
apex
purushottamdas
dalmia
w
air
l
mukherjee
madras
banwarilal
jhunjhunwala
union
india
mohan
baitha
bihar
signification
indicates
general
contained
therein
normally
expression
reference
variation
etymological
really
position
significance
lordship
situation
entitles
maintain
tribunal
group
operative
rise
base
sitting
factual
obtain
remedy
black
dictionary
enforceable
claim
phrase
comprises
traversed
plaintiff
th
edn
meaning
attributed
legal
parlance
existence
interference
behalf
hatsbury
england
simply
earliest
include
entitle
succeed
defendant
traverse
founding
merely
technical
supra
courtto
ipc
analyzed
eventually
thus
disclose
complainant
left
residing
city
sri
ganganagar
punjab
scenario
disclosed
inevitable
arose
magistrate
consequence
thereof
chief
quashed
returned
wish
file
appropriate
dealt
accordance
profit
manish
ratan
respond
ent
district
tikangarh
living
home
jabalpur
lodged
station
alleging
treating
information
report
datia
wherein
registered
incident
com
plaint
sister
saved
reached
uncle
bhopal
questioning
judi
cial
dis
missed
revision
holding
fence
cognizance
referred
hold
obtaining
matrix
forced
direction
issued
motion
registering
reveal
rinku
devi
informant
village
gawaya
ganesh
dutt
establish
marital
relationship
influenced
anshu
assault
illicit
elder
due
tortured
opened
aid
assistance
objected
assaulted
murdered
sheet
thorough
investigating
agency
deokaran
nenshi
susceptible
continuance
distinguishable
arises
put
obey
comply
rule
penalty
liability
obeyed
disobedience
noncompliance
occurs
recurs
distinction
omission
fresh
ingredient
absent
sujata
smt
prashant
specific
keeping
stating
hearing
gambhir
appearing
subjected
persistently
raigarh
raipur
isolated
event
consequential
series
appreciating
footing
maintainable
overt
paragraph
reveals
maltreatment
humiliation
ents
crimi
nal
clearly
attracted
ramesh
tamil
nadu
delve
trichy
suffice
say
looking
face
wholly
none
constituting
almost
pertain
extracting
mumbai
misappropriation
movable
met
inlaws
hotel
threat
torture
without
article
mostly
extenso
appreciate
residence
ipso
facto
worth
noting
construed
expose
en
tire
come
dwelling
distinguished
whisper
commission
logic
coderelating
applied
analysis
fruitfully
satvinder
kaur
govt
delhi
true
prescribed
subsection
extent
officer
investigate
cognizable
inquire
sub
providing
called
empowered
investigation
completed
provided
s
specifically
sufficient
suspicion
forwarding
forward
custody
arrives
f
forwarded
refuse
fir
enunciation
directed
return
filing
competent
resultantly
allowed
indicated
vinod
sharma
misc
quashing
anandpur
sahib
primarily
permanent
resident
sarita
vihar
finalized
column
m
mandeep
inderjeet
singh
phase
mohali
ropar
response
advertisement
bio
data
reputed
address
gurdwara
gurusingh
sabha
minor
meantime
got
pregnancy
shown
positive
termination
senior
superintendent
distt
rupnagar
bringing
slr
inderjit
sh
kartar
ward
hospital
retired
service
ago
pension
jasjit
balvir
bakshi
h
pocket
sikh
rite
ad
satisfaction
meeting
clothes
gurudwara
chandigarh
side
attend
saying
shared
guest
attended
function
restaurant
towards
pay
gold
jewellery
weighing
tolas
includes
groom
total
expenditure
incurred
approx
purchase
furniture
balbir
bhupinder
dever
jaswinder
devrani
kulwinder
mama
mami
torturing
beating
consoled
worry
speak
october
beaten
want
bring
loan
gurmeet
friend
jaspal
chopra
settle
people
agree
struck
rakabganj
handed
gave
mobile
repeating
nephew
lohri
forcibly
strict
justice
thanking
faithfully
ddr
challenged
registration
subsequent
statement
recorded
goyal
placed
reliance
amarpreet
haryana
rcr
crl
pleased
lay
similarly
tohana
agreement
admittedly
lived
whereas
uttar
pradesh
istridhan
rajinder
hamir
kept
ornament
nanad
turned
refused
empty
expected
aspect
cruelly
reading
pending
chargesheet
framing
st
class
hon
ble
supreme
minakshi
bala
sudhir
justified
cr
quash
except
rare
forensic
exigency
formidable
compulsion
compelling
certainly
invoke
already
found
use
allowing
continue
convict
waste
sanjay
khosla
sumina
lal
venue
determined
averment
disputed
jawali
kangra
himachal
together
cdisclosed
prosecution
actually
asj
noticed
today
end
soon
impugned
valid
sustainable
or
anr
reiterates
well
halsbury
vol
ix
occur
exception
belongs
country
blackstone
significant
purshottamdas
west
bengal
jhunhunwalla
implied
limited
specially
permitting
applicable
till
compliance
non
plea
relating
noted
crucial
essence
stranger
settled
bundle
enforce
redress
allegedly
affected
opponent
latter
possibly
accrue
arise
acquired
judicially
restricted
forming
infraction
immediate
wider
maintenance
including
coupled
compendiously
piece
employed
convey
idea
infringement
comprehensive
denote
forth
edition
chooses
brij
sita
sandeep
aggarwal
sudesh
gupta
reside
pritam
andhra
syed
khaja
mohiuddin
gujarat
raginiben
gunvantsinh
tank
gunvantlal
keshavlal
resides
anadpur
relied
laying
ratna
raj
mp
cjm
stayed
erred
amounted
ordains
interest
subserved
setting
exercise
constitution
transfer
force
mala
fide
attempt
influence
posted
laid
deserves
ordered
follow
presentation
granted
directing
retrospective
promotion
post
secondincommand
commandant
respectively
bsf
junior
promoted
along
benefit
writ
superseded
subsequently
representation
supersession
rejecting
duly
communicated
pronouncement
sukhdev
affirming
dev
separate
entry
annual
confidential
acrs
adverse
remark
benchmark
requiring
reconsideration
belated
stale
ought
dismissed
delay
laches
objection
counter
affidavit
cascading
administrative
chaos
mere
judgement
justification
dehors
candidature
prospective
grading
affirmed
mandatory
communication
deny
genuinely
bonafide
pursuing
authority
hoping
see
realised
forthcoming
approached
applicability
declared
seniority
superannuation
paramilitary
modified
chaman
rana
deputy
rank
departmental
dpc
grade
criterion
represented
rejection
accrued
seek
nonetheless
repeat
reasoned
empanelled
approaching
followed
instituted
gulshan
failed
secure
informed
instead
manifestly
initial
based
thereon
perceived
especially
urgency
third
work
promotional
ensconced
belief
protection
available
morale
additionally
serious
implication
apart
financial
burden
government
sadasivaswamy
period
six
month
utmost
denial
wise
discretion
unsettle
clog
impeding
genuine
promoting
head
least
limitation
never
interfere
passage
certain
length
extraordinary
expeditiously
happen
limine
entertaining
impedes
legitimate
normal
dismissing
gandhinagar
motor
transport
bombay
chagla
observing
excuse
presenting
pursue
pursued
extralegal
extrajudicial
final
mercy
indulgence
destabilising
unsettling
complete
sarkar
issue
dead
dispute
direct
expedition
leading
single
division
bench
distinguish
developing
natural
fairness
transparency
administration
poor
fair
average
servant
military
upgradation
placing
absolute
noticing
major
bahadur
discussing
fit
euclid
theorem
statute
appear
interpret
embark
lengthy
discussion
meant
explain
define
enthuse
lease
furnish
uttaranchal
shiv
charan
bhandari
everything
stop
slave
modus
operandi
syndrome
revive
discussed
jacob
director
geology
mining
caution
exercised
apposite
virtually
tsunami
resulting
unsustainable
insurance
company
kerala
review
reviewed
compensation
claimant
awarded
accident
award
vehicle
short
bodily
travelling
driver
owned
owner
policy
way
saju
paul
heavy
kl
cabin
driven
jayakumar
many
nilackal
rash
negligent
driving
capsized
suffered
fracture
remained
sustained
permanently
disabled
pathanamthitta
claimed
ofrs
insurer
impleaded
opposed
insofar
risk
passenger
covered
nearly
unauthorised
traveling
pursuance
contract
loading
unloading
representative
saddled
recording
favour
anddriver
relying
assurance
co
ltd
asha
national
cholleti
bharatamma
vide
gratuitous
recover
asunder
worksite
employer
stretch
imagination
fold
argument
carried
countenanced
proviso
cast
indemnify
employee
insured
arising
quote
authorized
insures
specified
damage
ii
cover
workman
engaged
conductor
examining
ticket
carriage
contractual
removal
hereby
deemed
notwithstanding
injured
damaged
led
namely
save
immediately
effective
four
expiry
whichever
effected
certificate
containing
note
seven
validity
notify
prescribe
anything
issuing
purport
authorised
added
various
intend
little
later
satpal
particularly
covering
exclude
vi
avail
correctness
doubted
inter
alia
needed
look
pgs
identical
stood
careful
scrutiny
insure
erroneous
impression
original
substituted
irresistible
widest
interpretation
amend
legislature
amends
amplification
clarification
plain
engrafted
difficult
construe
pre
existing
clarificatory
demonstrates
sweep
making
compulsory
dy
suffers
decided
paying
supplementary
concurring
pg
enjoin
statutory
furthermore
speaks
carrying
premium
enhanced
paid
ratio
logical
although
oriental
devireddy
konda
reddy
old
bare
legislative
intent
prohibit
addition
definition
becomes
solely
contemplated
appended
prescribing
mandate
coverage
wc
recent
satisfy
originally
slp
nalgonda
overruling
defence
herein
involved
squarely
proposition
aforementioned
no
claiming
kota
venkatarao
lorry
rebuttal
travelled
luggage
violation
fundamental
breach
afford
eschew
altogether
nagaraju
opined
travel
boarded
cleaner
anyone
existed
asharani
fully
reviewing
delivered
applying
erroneously
died
overlooked
construction
cease
thepolicy
founded
misconstruction
next
peculiar
baljit
confronted
upshot
equitable
clarify
overruled
served
recovery
suit
initiate
executing
determination
whereof
jointly
severally
resolved
challa
bharathamma
residual
beneficial
option
liberty
recovering
release
offending
attached
regional
payment
default
open
realisation
disposal
furnished
instant
quantum
decide
step
kaushalaya
deposited
withdrawn
refunded
initiated
roshan
light
larger
ranjit
saikia
parvathneni
cc
compel
permit
create
pendency
baljitkaur
stay
compelled
struggle
pursuant
invested
withdraw
disposed
allahabad
lucknow
contempt
managing
industrial
development
corporation
personnel
petitionnos
opposite
kanpur
ten
failing
shri
rakesh
uttamchandra
upadhyay
yatish
inform
board
resolution
increasing
age
approved
approval
approving
office
sidc
signature
secretary
department
arrangement
industry
retirement
regular
full
issuance
sanction
kindly
urgent
sd
mohd
ifekaruddin
desire
request
merit
jain
manufacture
sale
brand
branded
outlet
disentitle
assessee
notification
february
briefly
inspection
official
enforcement
commissionerate
hereinafter
revealed
cooky
retail
cookie
pvt
australia
auto
bake
accompanied
logo
depicting
smiling
mustachioed
chef
selling
plastic
pouch
container
described
printed
affixed
inscribed
excise
sold
loosely
plate
tissue
paper
receive
loose
received
sealed
displayed
separately
register
maintained
number
calculated
behind
document
recovered
executive
commissioner
classified
heading
biscuit
exemption
disallowed
controversy
packaging
embossed
eligible
scale
tax
appellate
south
zonal
revenue
central
manufactured
revolves
erstwhile
manufacturer
affix
trade
enunciated
mark
symbol
monogram
label
invented
writing
indicating
indicate
connection
using
indication
identity
march
iii
budget
ssi
scheme
explains
concession
unit
irrespective
affixation
changed
cleared
input
venkataraman
argued
combined
display
jamshedpur
superex
manifestation
disqualification
urge
surrounding
emphasis
cegat
lost
kirloskar
generating
invoice
infirmity
derived
recognizes
absurd
incapable
structure
unbranded
liquid
soft
drink
milk
product
powder
edible
salt
pepper
sweet
gaseous
perfume
deodorant
etc
gas
amorphous
brittle
solid
impossible
permissible
environment
conveys
wrapping
accessory
uniform
vendor
menu
card
hoarding
prop
entirety
factor
individually
inscription
dedicated
exclusive
conclusive
construing
stamped
generator
precise
formula
carry
weight
determining
strongly
kohinoor
elastic
indore
scrutinized
expanded
unambiguous
strictly
imply
purposely
framer
aware
consumer
captive
consumption
customer
reach
market
supplied
categoric
carve
obvious
permitted
captively
consumed
job
freely
foreclose
xxxxx
affixing
hereinabove
forgotten
knowledge
becoming
parcel
undergarment
getting
ultimate
know
forbidden
misunderstanding
distortion
completely
producer
retained
appearance
buying
associate
caveat
adhered
diluted
substituting
exhibit
confines
conspicuous
contain
fitting
square
peg
round
hole
untenable
fails
decipher
reduced
sticker
primary
focus
conveyed
highlighting
rukmani
pakkwell
trader
coming
ignored
design
drawing
arr
photograph
founder
reproduced
mahaan
cce
enable
wording
stretching
adding
conferred
elt
glass
private
potato
chip
chocolate
wafer
location
store
rebuttable
presumption
rebutted
contrary
important
hue
vary
supplanted
fail
transform
adjoining
interesting
argue
looked
gone
sell
convinced
business
foregoing
consequently
leaving
arijit
pasayat
call
legality
prayer
xviiith
metropolitan
saidapet
sans
toto
nagercoil
rival
finding
lack
parameter
adjudicated
vishwanath
iyer
batch
examinee
remaining
improved
ranking
exceptionally
declaration
expeditious
declare
tampering
guardian
perverse
divisional
regulation
enquire
unfair
conducted
conducting
acting
agent
education
compulsorily
formed
recommendation
control
subordinate
thereto
vested
regulated
appointment
screen
framed
samiti
licence
panchayat
upheld
premature
sugla
emerges
fabrication
behest
candidate
advantage
remind
exercising
domestic
body
evaluate
fairly
supported
uphold
inclined
reaching
responsible
fabricate
moderator
thereby
manifest
warranting
political
nation
fostering
secular
breaking
barrier
casteism
linguism
religious
bigotry
instrument
student
violative
revisional
supervisory
acted
justly
mete
recounting
pune
feed
computer
vitiated
complicity
cancellation
adoption
confirmed
inapplicable
require
restraint
flexibility
suffices
ensure
stake
immigration
injustice
minister
prepared
suggested
penultimate
cognizant
steep
decline
moral
contaminating
emphasised
cry
remain
mute
dumb
cleanse
amply
borne
correct
illegality
exceeded
dalveer
suresh
assistant
branch
governor
appoint
plus
usual
allowance
assume
gill
sukhcharan
bhatia
miscellaneous
entrusted
purely
temporary
terminable
assigning
fee
payable
salary
governed
rent
admissible
vii
viz
gratuity
encashment
viii
pensionable
ojha
judl
pertinent
patwalia
brief
recapitulated
superannuated
pensionary
wrongly
parashar
rampal
quoted
elaborately
stipulation
arbitrary
unjust
unconstitutional
shrilekha
vidyarthi
assn
mode
arun
saharya
swatanter
versus
engagement
intra
challenge
cheema
cwp
ca
listed
implement
absorb
instruction
adjourned
adopt
yardstick
distinguishing
attained
remains
process
disburse
terminal
retiral
dismiss
needle
processed
submits
deem
week
dua
false
july
sarpanch
understanding
chajoo
elected
nyaya
risia
bazar
tehsil
nanpara
bahraich
election
radhey
shyam
defeated
june
injunction
restraining
functioning
dismissal
seem
irregularity
wp
praying
mandamus
september
contesting
deponent
chhotey
sahayak
november
reproduce
constituted
list
allotted
consisting
panch
participated
rejoinder
throughout
choice
thereunder
rest
assertion
annexure
joshi
mantri
rulesand
gaon
asked
ministerial
crpc
january
survives
answered
negativing
repelled
appeared
witness
copy
supposed
worked
included
prompted
malice
initiating
immaterial
assailed
pressed
eradicating
perjury
override
expressly
inclusive
fabricating
applies
intentionally
fabricated
complying
undoubtedly
sworn
possible
operate
nageshwar
disposing
dishonest
motive
desired
probe
mathur
sdo
endorsed
predecessor
inexperience
ignorance
commonly
abused
deliberately
plausible
doubtful
deduce
swearing
discharged
success
possibility
conviction
explained
remote
carefully
lower
price
summons
suggest
sign
informing
panchas
establishment
endorsement
inserted
replied
formal
sanctioned
conscious
reasonably
probable
effectively
curbed
strong
start
readily
care
inconclusive
defeat
expedient
punish
delinquent
inaccuracy
innocent
falsehood
substance
sufficiently
adequate
mechanical
superficial
reflect
deliberation
implausible
inexpedient
substantially
lastly
lapse
irrelevant
expediency
militates
constrained
beg
despite
interlocutory
promote
basic
prevent
exceptional
procedural
facilitate
obstruct
substantive
pleading
intimation
deviation
litigation
concise
relies
divided
numbered
consecutively
figure
distinctly
contains
departure
signing
verification
striking
summary
exact
defeating
inefficient
initially
shortcoming
removed
inconvenience
rectified
remedial
unjustifiably
introduce
indirectly
inconsistent
amounting
substitution
depriving
antecedent
institution
lacking
defective
supply
introduction
cured
curable
ab
initio
barred
newly
trading
karnal
jai
parkash
firm
promissory
denying
asserted
incompetent
partnership
inadvertently
omitted
incorporate
consisted
deed
executed
april
execution
title
son
hari
railway
road
misdescription
description
averred
damodar
valley
decreed
reversed
declaratory
add
accounting
majority
da
amir
khan
ia
leach
jardine
skinner
mistake
speaking
cooke
cp
ever
robinson
unicos
futile
dornan
elli
prejudice
manohar
building
gurgaon
altered
proprietor
pleaded
hypertechnical
converted
eye
reversing
handmaid
negligence
inadvertence
blunder
compensed
careless
late
proposed
purushottam
umedbhai
manilal
compendious
collectively
civilprocedure
enabling
sue
sued
accorded
facility
privilege
outside
narula
cj
kanshi
reported
clj
dissented
rightly
agreed
ippili
satyanarayana
amadalavalasa
agricultural
ap
prejudiced
specification
character
abundant
nagpur
agarwal
jorawarmal
kasam
nag
vivian
bose
insolvency
render
existent
brings
suing
send
abide
mohapatra
hridaya
ranjan
prasad
verma
manoranjan
rajiv
kashi
nath
khasra
srinagar
siwan
succeeded
neurosurgeon
patna
manager
pathar
jhora
tea
garden
jalpaiguri
marketing
jay
shree
kanishka
sahkari
grih
nirman
sewan
cooperative
purchasing
land
dividing
draft
insistence
signed
safeguard
indemnity
undertook
loss
sharer
future
assert
possession
priya
alienating
cheque
dishonoured
insufficiency
drawer
akhil
partition
partitioned
amongst
interim
disturbing
status
quo
transferring
schedule
press
bounced
avoided
promising
finally
reminding
fund
mafsil
avdesh
narayan
rai
vice
president
named
shortly
cheating
wrongful
ensue
offender
protect
dishonestly
inducing
delivery
fraudulent
forgery
harming
reputation
insult
provoke
peace
conspiracy
counterblast
conspiring
defaulted
cheated
concocted
sada
kora
induced
enter
negotiation
advance
ulterior
acquire
gain
monetary
reputational
extracted
hereunder
proposal
exclusively
estate
hail
respectable
renowned
trustworthy
showing
believed
entered
assured
join
execute
attesting
scribed
dictation
sixth
praful
avoid
complication
retain
five
refund
trouble
executant
compensate
seeing
alternative
judiced
starting
nagendra
singhashani
munsif
concealed
detailed
defrauded
suppressing
believe
free
box
lowered
prestige
large
book
audit
bhajan
supp
backdrop
xiv
illustration
abuse
channelised
inflexible
guideline
rigid
exhaustive
myriad
pp
accompanying
justifying
purview
uncontroverted
collected
inherently
improbable
prudent
express
efficacious
maliciously
wreaking
vengeance
grudge
sparingly
circumspection
rarest
rupan
deol
bajaj
kanwar
pal
rajesh
nct
kuttan
rajya
orissa
bansidhar
enumerated
deceiving
fraudulently
induces
deceived
deliver
omit
cheat
concealment
deception
omitting
depends
inducement
judged
beginning
transaction
gist
promise
culpable
presumed
touchstone
warrant
allied
casesenumerated
accepting
impliedly
core
postulate
deceive
declining
oral
garshankar
hoshiarpur
therefrom
sir
harjinder
dilbag
fendor
brompton
ontario
canada
kirpal
satwant
sector
dadu
majra
colony
truck
arranged
performed
ceremony
preet
palace
rahon
nawanshahr
golden
kara
ring
woollen
joginder
bangle
fridge
cooler
washing
machine
utensil
lac
wedlock
simerdeep
born
sukhwinder
pressurizing
belonging
severe
pressurize
narrated
tale
woe
maltreated
harassed
insulted
visited
pressurized
child
resistance
tile
maltreating
became
emotionally
maintaining
earned
fight
dollar
penniless
frauded
illegally
occupying
trauma
dialogue
convince
greedy
sort
threw
concern
misappropriated
mi
appropriated
istri
dhan
link
denowal
kalan
connivance
malwinder
kashmir
dhanas
frivolous
abroad
created
photostat
journey
mohinder
forging
wing
threatening
indulged
firstly
excess
kill
grace
god
household
hatched
forged
lodging
duped
pretext
mockery
preparing
committing
applicant
prosecute
citizen
returning
levelled
sence
infarction
pharases
pharase
fourth
simple
classic
misuse
tool
vindicate
assessed
negotiable
summoning
outstanding
leveled
bathinda
summoned
moga
icici
dena
transpires
opposes
concatenation
unpaid
drawee
bhaskaran
sankaran
vaidhyan
balan
perpetrated
locality
sine
qua
completion
desai
dishonour
shivappa
nanda
belliappa
contend
accomplishment
commence
component
voux
men
authoritative
advised
choose
estopped
temple
documentary
tenant
assumption
substantial
belonged
concurrently
corroboration
ledger
reverse
definitely
ruling
maker
stepped
deposed
certified
tendering
photocopy
readable
lawful
strength
dispossess
restored
produce
lending
insignia
shifting
onus
interfered
pure
appreciation
arrived
reappreciating
evaluating
nagar
xii
notified
vacant
peaceful
mesne
rd
sufferance
wrongfully
extinction
lowest
subsist
realty
fiction
operating
trespass
acceptance
landlord
efflux
quit
tenancy
confer
incorporates
tukaram
ganpat
pandare
maharashtra
enables
fill
har
refusal
postal
addressee
imputed
madan
wazir
jaivir
chand
presume
hesitation
eviction
nopany
terminating
terminated
validly
tenanted
vacating
expired
intendment
vacate
cpc
rabinder
saha
sushma
dlt
jeevan
diesel
raising
presuming
suffer
serving
fertile
litigant
contest
expiring
virtue
legally
whittled
catena
shorten
repeatedly
innumerable
invalid
categorical
pasricha
jagannath
inconceivable
throw
forfeited
operation
occupation
maria
margarida
sequeria
fernandes
erasmo
jack
de
resisting
deserve
favor
lessee
renewal
performance
jindal
dyechem
pahwa
international
drj
dispatched
draw
vague
thrust
predominantly
escalating
dragged
unscrupulous
hope
huge
dalip
creed
cropped
shamelessly
resort
unethical
achieving
goal
mohammad
ahmad
atma
chauhan
motivation
litigate
prevalent
rate
continuation
granting
refusing
properly
considers
pragmatic
bounden
dishonesty
rendering
realistic
discourage
fruitful
encouraged
ramrameshwari
nirmala
author
imposition
actual
reality
imposing
wrongdoer
undue
uncalled
incentive
ordering
purity
sanctity
defend
hilt
decade
totally
quantify
aptly
page
parting
pen
flowing
docket
doer
discouraged
prolonging
rameshwari
strain
spend
dhruv
mehta
guiding
star
discretionary
obligatory
dispensing
inspire
united
lee
haven
ct
obtained
impeach
arriving
raise
reject
self
obviously
drag
current
rental
spectator
endeavour
ascertain
equal
deprivation
rightful
check
reaping
harvest
investment
santokh
huf
electricals
jasbir
chadha
radhakrishan
trust
maithan
agra
hindco
rotatron
disputing
renunciation
restrained
letting
vacates
receiving
oath
renewed
virender
prakash
padmawati
harijan
sewak
sangh
whereupon
ready
surrender
resorted
attempted
pollute
fountain
tainted
creating
reordering
rearranging
redrafting
defacto
authorise
basing
production
debar
corresponding
encompassed
falling
ambit
adopting
launched
lie
exclusion
clothed
complain
appropriately
close
embarking
satisfactorily
principally
prosecuting
confining
relate
ownership
misconception
suppose
trespassed
collecting
ruled
crystallized
versa
comprehensively
binding
adduced
advanced
gandhi
sangeeta
thakkar
sonia
gokani
preferred
hrp
ahmedabad
interfering
dispossessing
vacated
higher
forum
enumerating
bungalow
pahelgav
premdeep
housing
monthly
excluding
running
beauty
saloon
administrator
collector
collect
rented
sunit
shah
vehemently
emphasizing
across
street
run
salon
fernanades
stpl
web
wander
antrox
suppl
premji
ratansey
rame
gowda
dade
lr
varadappa
naidu
hindustan
petroleum
sriman
protected
pahva
chose
poorly
posse
worthwhile
southern
roadway
madurai
krishnan
taker
principal
anima
mallick
ajoy
roy
gratuitously
reclaimed
automobile
john
peter
dilatory
tactic
misconceived
discern
level
seriously
discovering
thatl
credibility
mohanlal
shamji
soni
reiterated
expect
inception
discovery
vindication
underlying
ritesh
tewari
quotation
voyage
quest
imperative
illustrative
purchased
inherited
method
license
insist
might
extinguished
entitlement
shift
encumbrance
threshold
critically
specificity
supporting
sufficiency
answer
interrogatory
sailing
estated
happens
enormous
minimized
puran
emerge
acquires
watchman
caretaker
forthwith
protecting
subsisting
whatsoever
antox
trespasser
gained
occupant
dispossessed
recourse
goowda
retake
peacefully
unreasonable
evict
injuncting
restoring
possessor
presumes
filmsy
recurring
intermittent
stray
casual
acquiesced
illustratively
munshi
rattan
multiplied
evicted
extending
interrupting
instate
intrusion
matured
obstructed
clarified
hard
mature
undisturbed
charm
magic
ritualistic
confined
strait
jacket
attribute
animus
possidendi
dispossession
quality
cultivable
grown
destroy
forcible
horam
rex
acquiring
accomplished
former
crux
discerned
equilibrium
lesser
spa
tulsi
paro
venkataswami
viscose
coimbatore
rajnibai
mannubai
kamla
sukkha
mahal
prataprai
kothari
braganza
sharif
adj
sikar
ramji
jagdish
mallah
thro
improper
confused
warranted
profitably
remember
kokkanda
poondacha
ganapathi
access
resulted
samar
extensive
exhaustively
factually
availability
insisted
urging
else
substantiating
nowhere
jurisdictional
independently
semblance
theory
believing
moment
wary
receives
acknowledge
questioned
maintainability
causing
inoperative
permission
admeasuring
sq
ceiling
aggregate
exempted
liberal
compensated
usha
balashaheb
swami
kiran
appaso
rid
altering
objectionable
serve
enjoyed
liberally
distinct
victim
foreign
confirming
oft
wide
judiciously
great
conclude
deciding
bona
honest
worthless
devoid
idop
kanyakumari
inpurushottamdas
relevance
reconsider
requesting
remanded
sachida
nand
sullied
desirability
defines
punishes
extension
conformity
broad
adjourn
restrictive
creates
projected
custodia
legis
play
embargo
kishori
measuring
kanals
marlas
situate
mauza
jadali
khanna
bigha
earnest
mortgaged
kishan
ludhiana
alienate
rfa
losing
inordinate
simultaneously
abhinav
ramkrishna
contending
wait
perused
re
integra
karam
ganga
converse
sheriff
precedence
conflicting
civiland
envisages
eventuality
refrain
sentence
likelihood
embarrassment
weighs
undesirable
everybody
swift
sure
absolved
early
consistent
impartial
slide
memory
dim
dressed
negatived
afresh
bind
suspending
disturbed
premshanker
privy
council
king
emperor
khwaja
nazir
pc
conceded
moreover
stopped
certainty
previous
swaroopa
narayana
alias
babu
simultaneous
iqbal
marwah
meenakshi
effort
askari
hadi
ali
augustine
imam
admn
incuriam
vishnu
daya
sapra
crystallised
casesmay
prompt
reporting
version
fatal
afterthought
coloured
frustrated
chagrined
vent
frustration
cheaply
degenerate
weapon
persecution
enmesh
arduous
chandrapal
maharaj
sagar
suri
gorige
pentaiah
genuineness
attorney
jaswant
mann
waterloo
enmeshing
addl
sr
divn
samrala
murder
convicted
sentenced
cra
db
titled
gurwinder
gora
proving
guilt
atik
yes
reportable
pathak
associated
individual
desirable
schematic
hierarchy
remove
miscarriage
corrected
salient
feature
closely
expanse
decides
uncorrected
healed
shaped
reinstate
superintendence
fittingly
suo
motu
advert
prime
highest
demonstrating
broadly
judiciary
insupportable
alleviate
pattern
decentralisation
successive
attempting
meandering
retrospectively
possessed
valuation
modification
repealed
civillaws
embodied
plainly
reverting
affect
generality
bifurcation
field
provincial
formerly
apparently
prefer
expensive
convenient
measure
enacting
cut
sharp
mutually
amenable
swarup
materially
reopened
phool
wati
gur
sahai
reverted
sphere
lasted
ante
flow
incorporated
history
divide
workload
decentralise
achieved
classifying
legislation
suppress
mischief
recognise
reduce
lose
contradiction
invade
enjoy
familiar
wields
example
triable
evidencing
assigned
jupiter
dwarka
diesh
dayal
occurring
satisfying
repository
vest
correcting
superior
finality
correction
barring
codemerely
embodies
remembered
relieve
represents
bimla
kohli
bandu
finance
revised
lapsed
infructuous
vishesh
shanti
remitted
identified
concurrent
parshad
revived
move
refers
treat
mislead
mentioning
pronounce
wheel
easy
speedy
comprehend
encouragement
impose
flooded
solve
experience
scarce
wasted
dasti
hear
suitable
bipartite
parte
restitution
swaran
observe
drastically
improve
arther
channell
quebec
tramcar
collision
jury
verdict
juror
connected
affinity
indifferent
array
montreal
excessive
revocation
requete
civile
beaudin
reception
monet
demurrer
appealed
disallowing
disallowance
panel
elaborate
minute
art
revising
revise
annually
grand
petit
municipality
qualified
sit
initialling
alteration
prothonotary
alist
fifteen
mile
reducing
neglected
observance
coram
judice
nullity
directory
maxwell
ed
null
void
neglect
hale
leicester
parke
gwynne
burnell
bing
reg
inhabitant
fordham
feuvre
millar
ballot
woodward
sarsons
philip
goff
q
margate
pier
hannam
greatest
distribute
secondly
thirdly
selection
packing
imposed
rotation
prevents
distributes
packed
unqualified
canadian
grose
holmes
electric
gathered
somewhat
recited
mc
crae
inclusion
qualification
composed
disqualified
mckay
glasgow
london
jurist
interested
english
mulcahy
willes
broken
guard
poll
unfounded
williams
western
ry
comparison
doe
michael
discovered
weaken
securing
hector
barsalou
erasmus
aunt
tutor
testamentary
twenty
infant
knew
broke
strongest
adviser
truly
pushed
emphatically
induce
differ
humbly
advise
majesty
sa
alagi
alamelu
achi
ponniah
mudaliar
mad
definite
vital
clean
o
abovementioned
weightage
integral
vogue
independence
era
proud
faith
triumph
evasive
passing
analyse
undeserved
neutralised
grindlays
ito
aim
enrichment
approve
eastern
coalfield
successful
assessable
withholding
doctrine
derive
merges
nullified
automatically
maxim
actus
curia
neminem
gravabit
undo
suitor
delayed
perpetuate
abusing
punitive
century
cherished
satya
ahimsa
violence
mahavir
gautam
buddha
mahatma
guided
ingrain
daily
drastic
materialism
overshadowed
ethos
intense
hesitate
shelter
misrepresentation
suppression
belong
posed
evolved
stream
touch
narain
badri
adverted
revoked
inaccurate
untrue
misleading
naturally
betray
confidence
characterises
welcom
misled
narayanaswamy
karnataka
acquisition
curiously
disclosure
frank
suppresses
chengalvaraya
jt
equity
invokes
reservation
twisted
scrutton
kensington
kb
adjudicating
deter
candidly
suppressed
distorted
papayya
sastry
intervenes
conscience
intervention
sunil
poddar
intends
contumacious
sail
concealing
candid
jayashree
bhagwandas
patel
task
implementing
retaining
surplus
tenure
holder
praveen
clh
sake
parentage
raghubir
tisotara
po
khas
pargana
kirat
pur
najibabad
bijnor
submit
incomplete
incorrect
published
herewith
seal
acre
irrigated
twelve
termed
tender
reconsidering
restoration
reconsidered
condonation
lekhpal
halqa
believable
remand
annexed
interregnum
distributed
landless
pradip
tahsildar
managed
communicate
stipulated
thirty
publication
gazette
grandson
categorically
abovereferred
scrutinised
persuading
frustrating
patently
continuous
illness
inability
suggestive
procure
memo
sick
persuaded
distribution
eleven
enabled
heir
boldly
grandfather
amazed
audacity
transmitted
reprehensible
polluting
exemplary
ratnavel
pandian
kutch
bhuj
canvassed
raid
cum
residential
seizure
lagadis
silver
brick
coin
seized
anjar
commencing
recall
mirchandani
seizing
assayer
mint
master
heavily
criticised
deplorable
lethargic
promptly
fortnight
examines
vigorously
gravely
ignoring
weighty
concluded
bolster
filling
lacuna
plugging
loophole
detrimental
prejudicial
entertainment
codesince
entertainable
adverting
xlvi
xxiv
verbatim
reproduction
insertion
permissive
summon
attendance
imposes
usage
spell
width
invoked
consistently
compels
cardinal
respective
adducing
withholds
unfavourable
presiding
umpire
combat
active
role
administering
salutary
whereunder
inchoate
speculative
empowering
admit
confirmation
innocence
xxix
confession
purporting
tendered
analogous
x
pleader
caption
accord
xviii
empowers
discover
complementary
jamatraj
kewalji
govani
albeit
recalling
paramount
lumpkin
epps
attention
administer
watch
expounded
hidayatullah
unfettered
envisaged
improviso
ingenuity
foresee
suddenly
unexpectedly
thinking
criticism
supportable
exceeding
carte
blanche
unguided
uncontrolled
uncanalised
circumscribed
underline
capriciously
arbitrarily
capricious
incumbent
disadvantage
disguise
retrial
fazal
rameshwar
meaningless
tulsidas
mundhra
conditioned
repetition
allows
retains
seisin
qualifying
pronounced
prosecuted
count
contraband
smuggled
improperly
exercisable
gajendragadkar
casesgoverned
casestriable
xxi
restrict
masalti
opt
rajeswar
prosad
ample
hardly
propose
refrained
restriction
mithani
dictated
safe
guide
command
indicted
rebut
weakened
adduce
offends
famous
audi
alteram
partem
armed
implicit
channu
rengaswami
naicker
muruga
shugan
lab
queen
assanoollah
swr
cri
whenever
absolutely
afforded
closure
currency
searched
contends
marking
waded
deposition
ingot
perusing
adipur
authorising
dutiable
elicited
procured
contravening
dhalia
panchnama
surprise
preceding
begun
discus
mir
omar
revisable
availed
straightway
fervent